#include <iostream>

using namespace std;

void main()
{
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡á ¡à ¡á ¡á ¡á ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡á ¡à ¡à ¡á ¡à ¡à ¡à ¡á ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡¤ ¡à ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡á ¡¤ ¡à ¡á ¡à ¡á ¡á ¡á ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡à ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡á ¡á ¡à ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡á ¡¤ ¡¤ ¡á ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡á ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡à ¡á ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡á ¡à ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡á ¡á ¡¤ ¡¤ ¡¤ ¡à ¡á ¡à ¡¤ ¡á ¡á ¡à ¡à ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡á ¡à ¡á ¡á ¡á ¡á ¡à ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡á ¡á ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡á ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡à ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡á ¡à ¡á ¡á ¡á ¡á ¡á ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡á ¡á ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡á ¡à ¡à ¡à ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡á ¡à ¡à ¡à ¡á ¡¤ ¡à ¡à ¡à ¡à ¡à ¡à ¡à ¡¤ ¡¤ ¡à ¡à ¡á ¡à ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡á ¡à ¡à ¡á ¡à ¡¤ ¡¤ ¡à ¡à ¡à ¡à ¡à ¡¤ ¡¤ ¡¤ ¡à ¡à ¡á ¡à ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡á ¡á ¡á ¡á ¡á ¡à ¡¤ ¡à ¡à ¡à ¡à ¡à ¡¤ ¡¤ ¡à ¡à ¡á ¡á ¡á ¡à ¡à ¡à ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡á ¡á ¡¤ ¡¤ ¡á ¡á ¡á ¡à ¡à ¡à ¡à ¡à ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡à ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤ ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡á ¡á ¡á ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
	cout << "¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤ ¡¤" << endl;
}