#include <iostream>

using namespace std;

void main()
{	
	cout << "=================================================================== " << endl;
	cout << "бл                ░╘└╙┐б╝н ┴┴╛╞╟╧┤┬ ░═ : ╞ў  ╝╟                    бл " << endl;
	cout << "=================================================================== " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бс бс бс бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бс бс бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бс бс бс бр бр бс бр бр бр бр бр бс бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бс бс бр бр бр бр бр бр бр бс бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бс бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бс бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бс бс бр бр бр бс бр бр бр бр бр бр бр бр бр бр бс бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бс бр бс бр бр бр бс бр бр бр бр бр бр бр бр бс бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бс бр бр бр бс бс бр бр бр бр бр бс бс бс бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бс бс бр бр бр бс бс бр бр бс бс бр бр бс бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бс бр бр бр бс бс бс бр бр бс бс бс бр бр бр бс бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бс бр бр бр бр бр бр бс бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бс бс бр бр бр бс бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бс бр бс бс бс бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бс бр бс бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бс бр бс бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бс бр бр бр бс бс бр бр бр бс бс бс бс бс бс бс бр бс бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бс бр бр бс бр бр бс бс бс бр бр бр бр бр бс бр бс бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бс бр бс бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бс бр бс бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бс бр бр бр бс бр бр бр бр бр бр бр бр бс бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бс бр бр бр бр бс бр бр бр бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бс бр бр бр бр бр бс бс бр бр бр бс бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бс бр бр бр бр бр бр бр бс бс бс бс бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бс бс бс бр бр бр бр бр бр бс бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бс бс бс бс бс бс бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "бл бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бр бл " << endl;
	cout << "=================================================================== " << endl;
}